In [1]:
lst = [11,12,13,1,425,35,5,66,6,7,989,8,3465,676,7]
listd = []
for i in lst:
    if i%2==0:
        listd.append(i)
print(listd)

[12, 66, 6, 8, 676]

In [2]:
listd = [i for i in lst if i%2==0]
print(listd)

[12, 66, 6, 8, 676]

In [4]:
def square(x):
    return x*x

num = [1,2,3,4,5]
num_square = map(square, num)

for num in num_square:
    print(num)

1
4
9
16
25

In [12]:
my_tup = (5,12,10,18,43,9,7,11,6)
new_tup = tuple(filter(lambda x:(x%3==0),my_tup))
print(new_tup)

(12, 18, 9, 6)

In [30]:
import pandas as pd

emp = {'name':['a','b','c','g'],
      'age':[23,45,34,23],
      'city':['abc','frg','hkjh','rtu']
      }
print(emp)

{'name': ['a', 'b', 'c', 'g'], 'age': [23, 45, 34, 23], 'city': ['abc', 'frg', 'hkjh', 'rtu']}

In [31]:
df = pd.DataFrame(emp)

In [32]:
df

  name  age  city
0    a   23   abc
1    b   45   frg
2    c   34  hkjh
3    g   23   rtu

In [34]:
df.loc[0:2,['age','city']]

   age  city
0   23   abc
1   45   frg
2   34  hkjh

In [36]:
df.iloc[0:2,0:2]

  name  age
0    a   23
1    b   45

In [39]:
print(df.loc[df['age']>30,['name','city']])

  name  city
1    b   frg
2    c  hkjh

In [49]:
lst1 = ['india', 'usa', 'canada']
print(len(lst1))
lst1.append(['france','spain'])
print(lst1)
print(len(lst1))

3
['india', 'usa', 'canada', ['france', 'spain']]
4

In [50]:
lst1 = ['india', 'usa', 'canada']
print(len(lst1))
lst1.extend(['france','spain'])
print(lst1)
print(len(lst1))

3
['india', 'usa', 'canada', 'france', 'spain']
5

In [51]:
df

  name  age  city
0    a   23   abc
1    b   45   frg
2    c   34  hkjh
3    g   23   rtu

In [59]:
f = lambda x: 'aged' if x>=30 else 'not aged'
df['status']=df['age'].apply(f)
print(df)

  name  age  city    status
0    a   23   abc  not aged
1    b   45   frg      aged
2    c   34  hkjh      aged
3    g   23   rtu  not aged

In [60]:
import numpy as np

In [67]:
m = np.arange(1,17).reshape(4,4)
m

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

In [69]:
print(m.diagonal())

[ 1  6 11 16]

In [70]:
print(m.diagonal().sum())

34